//Задача N3 по определению четного числа

Console.WriteLine("Введите число, четность которого хотите проверить: ");

int numberA = int.Parse(Console.ReadLine());

if(numberA % 2 = 0)
{
    Console.WriteLine("Является четным числом");
}
else
{
    Console.WriteLine("Является нечетным числом");
}
